# -*- coding: utf-8 -*-
"""
문3) 다음 sigmoid 함수 식을 참고하여 sigmoid 함수를 정의하고,
     입력변수(x)를 실인수로 넣어서 <출력 결과>와 같이 테스트하시오.      
     
         <출력 결과>  
 x : -5.0 -> y : 0.006692850962281227
 x : -4.0 -> y : 0.01798621006309986
 x : -3.0 -> y : 0.04742587357759476
 x : -2.0 -> y : 0.11920291930437088
 x : -1.0 -> y : 0.2689414322376251
 x : 0.0 -> y : 0.5
 x : 1.0 -> y : 0.7310585975646973
 x : 2.0 -> y : 0.8807970285415649
 x : 3.0 -> y : 0.9525741338729858
 x : 4.0 -> y : 0.9820137619972229
 x : 5.0 -> y : 0.9933071732521057   
"""

import tensorflow as tf # exp() 함수 사용  
import numpy as np # 입력변수(x변수) 생성  

'''
 sigmoid 함수 식 
  y =  1 / 1 + exp(-x)
 
 x : 입력변수 
 exp() : 지수함수  
'''

# sigmoid 함수 정의 
def sigmoid(x) : # x(입력변수) 
     y =  1 / (1 + tf.math.exp(-x))
     return y


# 입력변수(x) : 실인수 
x_data = np.arange(-5.0, 6.0) # -5.0 ~ +5.0 


real_x = sigmoid(x_data)

for i in x_data:
    y = sigmoid(i)
    print(f'x : {i} -> y : {y}')

    
    
    
    
    
    
    
    
    